Revit 2027 API
ConstraintToRebarEdgeProperties.GetTargetRebarEdge Method
 Gets the target rebar edge.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TargetRebarEdge GetTargetRebarEdge()
Public Function GetTargetRebarEdge As TargetRebarEdge
public:
TargetRebarEdge^ GetTargetRebarEdge()
member GetTargetRebarEdge : unit -> TargetRebarEdge
Return Value
TargetRebarEdge
 Returns the target rebar edge.
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace